import numpy as np
import func
c = [[13, 18, 20, 16, 19],
                     [19, 10, 22, 25, 26],
                     [14, 10, 8, 12, 10],
                     [12, 12, 19, 13, 14],
                     [25, 20, 18, 21, 27]]
c1 = [[13, 18, 20, 16, 19],
                     [19, 10, 22, 25, 26],
                     [14, 10, 8, 12, 10],
                     [12, 12, 19, 13, 14],
                     [25, 20, 18, 21, 27]]

task = int(input("Введите 0 для задания 1, введите 1 для задания 2, введите 2 для задания 3: "))
if (task == 0) or (task == 1):
    func.some(c,c1,task)

elif (task == 2):
    P0 = [[],[]]
    for i in range(0,len(c1)):
        P0[0].insert(i,i+1)

    for i in range(0, len(c1)):
        P0[1].insert(i,int(input("Введите работников: ")))
    func.some_3(P0,c,c1)
else:
    print("Ошибка")
