import numpy as np
import func

c = [[27, 25, 20, 19, 21],
                     [19, 13, 12, 20, 16],
                     [26, 19, 10, 22, 25],
                     [10, 14, 10, 8, 12],
                     [14, 15, 18, 19, 13]]
c1 = [[27, 25, 20, 19, 21],
                     [19, 13, 12, 20, 16],
                     [26, 19, 10, 22, 25],
                     [10, 14, 10, 8, 12],
                     [14, 15, 18, 19, 13]]

task = int(input("Введите 0 для задания 1, введите 1 для задания 2, введите 2 для задания 3: "))
if (task == 0) or (task == 1):
    func.some(c,c1,task)

elif (task == 2):
    P0 = [[],[]]
    for i in range(0,len(c1)):
        P0[0].insert(i,i+1)

    for i in range(0, len(c1)):
        P0[1].insert(i,int(input("Введите работников: ")))
    func.some_3(P0,c,c1)
else:
    print("Ошибка")
